#ifndef HEAP_FILE_H
#define HEAP_FILE_H

#define MAX_OPEN_FILES 20

typedef enum HP_ErrorCode {
  HP_OK,
  HP_ERROR
} HP_ErrorCode;

typedef struct Record {
	int id;
	char name[15];
	char surname[20];
	char city[20];
} Record;

typedef struct HP_info {
	int fileDesc;
	char attrType;
	char attrName[8];
	int attrLength;
} HP_info;

void set_attrName(HP_info *hp_info, char *name);

/*
 * Η συνάρτηση HP_CreateFile χρησιμοποιείται για τη δημιουργία και
 * κατάλληλη αρχικοποίηση ενός άδειου αρχείου σωρού με όνομα fileName.
 * Σε περίπτωση που εκτελεστεί επιτυχώς, επιστρέφεται HP_OK, ενώ σε
 * διαφορετική περίπτωση κάποιος κωδικός λάθους.
 */
int HP_CreateFile(  char *fileName,
					char attrType,
					char *attrName,
					int attrLength		
	);


/*
 * Η συνάρτηση HP_OpenFile ανοίγει το αρχείο με όνομα filename και διαβάζει
 * από το πρώτο μπλοκ την πληροφορία που αφορά το αρχείο σωρού. Επιστρέφει
 * στην μεταβλητή fileDesc τον αναγνωριστικό αριθμό ανοίγματος αρχείου, όπως
 * αυτός επιστράφηκε από το επίπεδο διαχείρισης μπλοκ. Σε περίπτωση που
 * εκτελεστεί επιτυχώς, επιστρέφεται HP_OK, ενώ σε διαφορετική περίπτωση
 * κάποιος κωδικός λάθους. Αν το αρχείο που ανοίχτηκε δεν πρόκειται για αρχείο
 * σωρού, τότε αυτό θεωρείται επίσης περίπτωση σφάλματος.
 */
HP_info* HP_OpenFile( char *fileName	);

/*
 * Η συνάρτηση HP_CloseFile κλείνει το αρχείο που προσδιορίζεται από τον
 * αναγνωριστικό αριθμό ανοίγματος fileDesc. Σε περίπτωση που εκτελεστεί
 * επιτυχώς, επιστρέφεται HP_OK, ενώ σε διαφορετική περίπτωση κάποιος
 * κωδικός λάθους.
 */
int HP_CloseFile(	HP_info* header_info 		/* αναγνωριστικός αριθμός ανοίγματος αρχείου */
	);

/*
 * Η συνάρτηση HP_InsertEntry χρησιμοποιείται για την εισαγωγή μίας
 * εγγραφής στο αρχείο σωρού. Ο αναγνωριστικός αριθμός ανοίγματος του
 * αρχείου δίνεται με την fileDesc ενώ η εγγραφή προςεισαγωγή προσδιορίζεται
 * από τη δομή record. Η εγγραφή προστίθεται στο τέλος του αρχείου, μετά την
 * τρέχουσα τελευταία εγγραφή. Σε περίπτωση που εκτελεστεί επιτυχώς,
 * επιστρέφεται HP_OK, ενώ σε διαφορετική περίπτωση κάποιος κωδικός λάθους.
 */
int HP_InsertEntry(	HP_info header_info,		
					Record record		/* δομή που προσδιορίζει την εγγραφή */
	);

/*
 * Η συνάρτηση HP_PrintAllEntries χρησιμοποιείται για την εκτύπωση όλων των
 * εγγραφών που υπάρχουν στο αρχείο σωρού. Το fileDesc είναι ο αναγνωριστικός
 * αριθμός ανοίγματος του αρχείου, όπως αυτός έχει επιστραφεί από το επίπεδο
 * διαχείρισης μπλοκ. Σε περίπτωση που εκτελεστεί επιτυχώς, επιστρέφεται HP_OK,
 * ενώ σε διαφορετική περίπτωση κάποιος κωδικός λάθους.
 */
int HP_GetAllEntries(	HP_info header_info,				
								void *value         /* τιμή προς αναζήτηση */
	);
	
	
int HP_DeleteEntry(	HP_info header_info, void *value );



#endif // HEAP_FILE_H
